---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.OverlapFailures.OverlappingElementsTest
source: html/f4c75062-03bf-4bc8-175e-c9c92bf02bbd.htm
---
# Autodesk.Revit.DB.BuiltInFailures.OverlapFailures.OverlappingElementsTest Property

There are overlapping structural framing elements of the same type in the project found by Dynamic Update.

## Syntax (C#)
```csharp
public static FailureDefinitionId OverlappingElementsTest { get; }
```